white-space/white-space-backend/app/controllers/routines_controller.rb

  def index
    routines = Routine.all.as_json(include: :todos)
---
SELECT "routines".* FROM "routines"
SELECT "todos".* FROM "todos" WHERE "todos"."routine_id" = ?  [["routine_id", 1]]

  def create
    routine = Routine.create(title: params[:title])
---
INSERT INTO "routines" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "da"], ["created_at", "2019-07-09 00:45:17.123546"], ["updated_at", "2019-07-09 00:45:17.123546"]]

  def destroy
    routine = Routine.find(params[:id])
    routine.destroy
---
SELECT  "routines".* FROM "routines" WHERE "routines"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
DELETE FROM "routines" WHERE "routines"."id" = ?  [["id", 5]]