white-space/white-space-backend/app/controllers/todos_controller.rb

  def index
    todos = Todo.all.as_json
---
SELECT "todos".* FROM "todos"

  def create
    todo = Todo.create(name: params[:name], duration: params[:duration], routine_id: params[:routine_id])
---
INSERT INTO "todos" ("name", "duration", "routine_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "da"], ["duration", "1"], ["routine_id", 1], ["created_at", "2019-07-09 18:23:40.399403"], ["updated_at", "2019-07-09 18:23:40.399403"]]

  def destroy
    todo = Todo.find(params[:id])
    todo.destroy
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 4]]